export const state = {
    newsList: [
        {
            "id": 1066.727980981468,
            isDraft: false,
            "rubricsUri": ["bitie"],
            "authorId": 1,
            "publicationDate": 1586571087492,
            "title": "Львы на свободе",
            "text": 'lol'
        },
        {
            id: 313187712,
            isDraft: false,
            rubricsUri: ['putin'],
            authorId: 2,
            publicationDate: 1574199356,
            annotation: 'Равным образом консультация с широким активом требуют определения и уточнения модели развития. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности способствует подготовки и реализации форм развития. Если у вас есть какие то интересные предложения, обращайтесь! Студия Web-Boss всегда готова решить любую задачу.',
            title: 'Новость №2',
            text: '<p>Равным образом консультация с широким активом требуют определения и уточнения модели развития. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности способствует подготовки и реализации форм развития. Если у вас есть какие то интересные предложения, обращайтесь! Студия Web-Boss всегда готова решить любую задачу.</p>'
        },
        {
            id: 3131231123152,
            isDraft: false,
            rubricsUri: ['putin'],
            authorId: 6,
            publicationDate: 1532036156,
            annotation: 'Товарищи! сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.</p><p>Товарищи! сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.',
            title: 'Новость №3',
            text: '<p>Товарищи! сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.</p><p>Товарищи! сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.</p>'
        },
        {
            id: 3176758312312,
            isDraft: false,
            rubricsUri: ['putin'],
            authorId: 1,
            publicationDate: 1500500156,
            annotation: 'С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач.',
            title: 'Новость №4',
            text: '<p>С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач.</p>'
        },
        {
            id: 313123129999,
            isDraft: false,
            rubricsUri: ['siriya'],
            authorId: 1,
            publicationDate: 1543613756,
            annotation: 'Равным образом консультация с широким активом требуют определения и уточнения модели развития. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.',
            title: 'Новость №5',
            text: '<p>Равным образом консультация с широким активом требуют определения и уточнения модели развития. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.</p>'
        },
        {
            id: 313123134142,
            isDraft: false,
            rubricsUri: ['koronavirus'],
            authorId: 10,
            publicationDate: 1569879356,
            annotation: 'С другой стороны укрепление и развитие структуры обеспечивает участие в формировании систем массового участия. Таким образом новая модель организационной деятельности способствует подготовки и реализации систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.',
            title: 'Новость №6',
            text: '<p>С другой стороны укрепление и развитие структуры обеспечивает участие в формировании систем массового участия. Таким образом новая модель организационной деятельности способствует подготовки и реализации систем массового участия. Идейные соображения высшего порядка, а также рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.</p>'
        },
        {
            id: 3100012312,
            isDraft: false,
            rubricsUri: ['siriya'],
            authorId: 6,
            publicationDate: 1561498556,
            annotation: 'Таким образом реализация намеченных плановых заданий позволяет оценить значение новых предложений. Разнообразный и богатый опыт консультация с широким активом обеспечивает широкому кругу. Равным образом рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.',
            title: 'Новость №7',
            text: '<p>Таким образом реализация намеченных плановых заданий позволяет оценить значение новых предложений. Разнообразный и богатый опыт консультация с широким активом обеспечивает широкому кругу. Равным образом рамки и место обучения кадров влечет за собой процесс внедрения и модернизации системы обучения кадров, соответствует насущным потребностям.</p>'
        },
        {
            id: 3222222312312,
            isDraft: false,
            rubricsUri: ['koronavirus'],
            authorId: 11,
            publicationDate: 1566250556,
            annotation: 'Идейные соображения высшего порядка, а также дальнейшее развитие различных форм деятельности позволяет оценить значение новых предложений. Равным образом консультация с широким активом требуют определения и уточнения модели развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.',
            title: 'Новость №7',
            text: '<p>Идейные соображения высшего порядка, а также дальнейшее развитие различных форм деятельности позволяет оценить значение новых предложений. Равным образом консультация с широким активом требуют определения и уточнения модели развития. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности обеспечивает широкому кругу (специалистов) участие в формировании новых предложений.</p>'
        },
        {
            id: 3333331312312,
            isDraft: false,
            rubricsUri: ['siriya'],
            authorId: 111,
            publicationDate: 1569360956,
            annotation: 'Не следует, однако забывать, что дальнейшее развитие различных форм деятельности способствует подготовки и реализации форм развития. Разнообразный и богатый опыт консультация с широким активом обеспечивает широкому кругу. Таким образом реализация намеченных плановых заданий позволяет оценить значение новых предложений.',
            title: 'Новость №8',
            text: '<p>Не следует, однако забывать, что дальнейшее развитие различных форм деятельности способствует подготовки и реализации форм развития. Разнообразный и богатый опыт консультация с широким активом обеспечивает широкому кругу. Таким образом реализация намеченных плановых заданий позволяет оценить значение новых предложений.</p>'
        },
        {
            id: 131231241,
            isDraft: false,
            rubricsUri: ['bitie'],
            authorId: 1,
            publicationDate: 1576182956,
            annotation: 'Товарищи! консультация с широким активом позволяет выполнять важные задания по разработке систем массового участия. Разнообразный и богатый опыт консультация с широким активом обеспечивает широкому кругу. Идейные соображения высшего порядка, а также укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий.',
            title: 'Новость №9',
            text: '<p>Товарищи! консультация с широким активом позволяет выполнять важные задания по разработке систем массового участия. Разнообразный и богатый опыт консультация с широким активом обеспечивает широкому кругу. Идейные соображения высшего порядка, а также укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий.</p>'
        },
        {
            id: 12312312,
            isDraft: false,
            rubricsUri: ['siriya'],
            authorId: 1,
            publicationDate: 1550007356,
            annotation: 'Товарищи! сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Таким образом новая модель организационной деятельности способствует подготовки и реализации систем массового участия.',
            title: 'Новость №10',
            text: '<p>Товарищи! сложившаяся структура организации представляет собой интересный эксперимент проверки направлений прогрессивного развития. Таким образом новая модель организационной деятельности способствует подготовки и реализации систем массового участия.</p>'
        },
        {
            id: 988231,
            isDraft: false,
            rubricsUri: ['bitie'],
            authorId: 1,
            publicationDate: 1551735356,
            annotation: 'Равным образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании системы обучения кадров, соответствует насущным потребностям. Разнообразный и богатый опыт консультация с широким активом обеспечивает широкому кругу.',
            title: 'Новость №101213',
            text: '<p>Равным образом постоянный количественный рост и сфера нашей активности играет важную роль в формировании системы обучения кадров, соответствует насущным потребностям. Разнообразный и богатый опыт консультация с широким активом обеспечивает широкому кругу.</p>'
        },
    ],
    shownNews: []
}
export const mutations = {
    GET_ALL_NEWS(state) {
        state.shownNews = state.newsList
    },
    GET_RUBRIC_NEWS(state, uri) {
        const newsByUri = state.newsList.filter(el => el.rubricsUri.indexOf(uri) !== -1)
        state.shownNews = [...newsByUri]
    },
    ADD_ARTICLE(state, article) {
        state.newsList.push(article)
    }
}
export const actions = {}
export const getters = {}